<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
 // | Copyright (c) 2010-2023 www.wq520wq.cn All rights reserved..
// +----------------------------------------------------------------------
// | 端庄、优雅、闲庭
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
declare(strict_types = 1);

namespace Validate\Common;

/**
 * 公共属性
 * @author 王强
 */
trait CommonAttribute 
{
    /**
     * 待验证数据
     * @var T
     */
    private $data;
    
    /**
     * 消息
     * @var string
     */
    private $message = '';
    
    /**
     * @return the $data
     */
    public function getData() :array
    {
        return $this->data;
    }
    
    /**
     * @return the $message
     */
    public function getMessage() :string
    {
        return $this->message;
    }
    
    /**
     * @param \Validate\Children\T $data
     */
    public function setData(array $data) :void
    {
        $this->data = $data;
    }
    
    /**
     * @param string $message
     */
    public function setMessage($message) :void
    {
        $this->message = $message;
    }
}

